{
    "欢迎来到": "Welcome",
    "数学魔法卡": "MMC",
    "的世界!": "'s World!",
    "完整规则": "Full Rule",
    "卡片库": "Card DataBase",
    "关于": "About",
    "新闻": "News",
    "Q: 什么是TCG?": "Q: What is TGC?",
    "A: TCG 是 Trading Card Game 的缩写，翻译为“交换卡牌游戏”。这类游戏通常是指玩家使用自己的卡片组合来与其他玩家对抗。每个卡片代表着不同的角色、能力或装备等，可以通过购买卡片包或者与其他玩家交换来获取更多的卡片，从而丰富自己的卡片库并提高在游戏中的实力。知名的 TCG 游戏包括《魔法飞球》（Magic: The Gathering）、《炉石传说》（Hearthstone）、《游戏王》（Yu-Gi-Oh!）等。": "A: TCG stands for Trading Card Game, which refers to a type of game where players use their own card combinations to compete against other players. Each card represents different characters, abilities, or equipment, and can be obtained by purchasing card packs or trading with other players to enrich their card collections and improve their strength in the game. Well-known TCG games include Magic: The Gathering, Hearthstone, Yu-Gi-Oh!, etc.",
    "Q: 数学魔法卡是一个什么样的游戏？": "Q: What kind of game is Math Magic Card?",
    "A: 数学魔法卡，是一个致力于将纯粹的数学概念融入到桌游中的游戏。当然里面会有魔法的部分，但是我保证核心获胜的机制是数学概念。": "A: Math Magic Card is a game dedicated to integrating pure mathematical concepts into tabletop games. Of course, there will be magical elements, but I guarantee that the core winning mechanism is based on mathematical concepts.",
    "Q: 为什么要设计这样的游戏？": "Q: Why design such a game?",
    "A: 单纯出于好玩。": "A: Just For Fun!",
    "sample": {
        "name": "Junior Number One",
        "desc": "Category: Natural/Odd\r\nWhen set this card in [Value Area], you can take a card with [Natural] Category from desk to your hand.",
        "lang": "en"
    },
    "sample2": {
        "name": "Addition",
        "desc": "Category: Symmetry/Operator.\r\n",
        "lang": "en"
    },
    "sample3": {
        "name": "It is an even number!",
        "desc": "Category: Assertion/ Natural Number.\r\n",
        "lang": "en"
    },
    "简易规则": "Simple Rule",
    "值卡": "Value Card",
    "值卡表示最纯粹的值。比如数字1或者数字2。它们的意义和你平时理解的数学上的1和2是差不多的。只是以卡片的形式体现。": "Value cards represent the purest form of value, such as the number 1 or the number 2. Their meaning is similar to what you would understand as mathematical 1 and 2 in everyday life, just expressed in the form of cards.",
    "右侧的图片就是一张值卡": "The picture on the right is a value card.",
    "【最初的数字 1】是卡片的名字": "[Junior Number One] is the name of the card",
    "黑板（也就是公式区）中的白字是它的值。": "The white text in the blackboard (also known as formula area) is its value.",
    "下方的描述是效果，在简易规则里你可以忽略这些。": "The description below is the effect. You can ignore these in the simple rule. ",
    "圆圈中的黄色代表了这张卡是值卡。请习惯利用颜色分辨卡的功能。": "The yellow color in the circle represents that this card is a value card. Please get used to distinguishing the function of cards by their colors.",
    "算子卡": "Operator Card",
    "算子这个概念可能在你的生活中并不常见，但是你一定知道+这个符号。它一般也被叫做加法符号，我们这里说的算子卡就是类型与+、-之类你常见的技术符号。你可能也感觉到了，算子卡表示的符号可以把两个‘值’（游戏里对应值卡）链接在一起，从而形成一个新的式子。比如：1+1,4-3之类的。": "you certainly know the symbol +. It is generally called the addition symbol. The operator cards we are referring to here are similar to technical symbols that you commonly encounter, such as + and -. As you may have noticed, operator cards represent symbols that can link two 'values' (corresponding to value cards in the game) together to form a new expression, such as 1+1, 4-3, and so on.",
    "算子由蓝色代表": "The operator is represented by blue.",
    "断言卡": "Assertion Card",
    "断言卡上有一句断言，用来描述一个数学概念。比如“这是偶数”、“这是奇数”。通过值卡和算子卡构成的式子我们可以得出一个值。然后我们通过我们的数学知识就可以知道这个断言的真假了。比如 1+1 | 是奇数，1+1 | 是偶数。我们可以知道第一个组合是假，第二个组合是真。": "An Assertion card contains a statement describing a mathematical concept, such as \"this is an even number\". We can obtain a value through an expression formed by Value cards and Operator cards, and then use our mathematical knowledge to determine the truth or falsehood of the assertion.",
    "断言由红色代表": "The assertion is represented by red",
    "VP表示胜利点数，DP表示失败点数": "VP represents victory points, and DP represents defeat points.",
    "游戏流程": "Game Flow",
    "游戏准备": "Prepare",
    "进行阶段1": "Phase 1",
    "进行阶段2": "Phase 2",
    "游戏终止": "End",
    "卡组构建": "Deck construction",
    "一般要40~60张卡": "It usually requires 40-60 cards",
    "如果没法两个人都有各自的卡组暂时共享一套也是可以的": "If it's not possible for both people to have their own card decks, temporarily sharing a set is also possible",
    "决定先后": "Who go first?",
    "猜硬币或者猜拳都是可以的": "Guessing coins or Rock-paper-scissors",
    "初始手卡": "Initial hand card",
    "5张": "5",
    "手卡上限": "limit of hand card",
    "不大于7张。在每个回合结束前要弃置至7张。": "No more than 7. Discard up to 7 cards before the end of each round.",
    "游戏场地": "playground",
    "现在想象在你和对手之间有一些格子。总共有五个，正好可以放置5张卡片。奇数的位置处专门摆放值卡，偶数的位置处专门摆放算子卡。我们给这五个格子取个名字：“泳道”。奇数位叫做“值区”，偶数位叫做“算子区”。然后随便找个离自己近的位置。取名叫做“断言区”，你可能已经感觉出来了，这里是专门摆放断言卡的。不同的是：值区和算子区只能放着一张卡，断言区可以放许多张。你和对手各有一个断言区。": "Now imagine there are some spaces between you and your opponent. There are a total of five, which is just enough to place five cards. Odd-numbered places are for value cards, and even-numbered ones are for operator cards. Let's name these five spaces \"lanes\". The odd-numbered lane is called the \"value area\", and the even-numbered lane is called the \"operator area\". Then find a nearby location and name it the \"assertion area.\" You may have already guessed that this is where assertion cards are specifically placed. The difference is that only one card can be placed on the value and operator areas, while many cards can be placed on the assertion area. You and your opponent each have an assertion area.",
    "casePic": "pic/case_en.jpg"
}